app/controllers/chat_rooms_controller.rb

  def index
    @chat_rooms = ChatRoom.all
---
SELECT "chat_rooms".* FROM "chat_rooms"

  def create
    @chat_room = current_user.chat_rooms.build(chat_room_params)
    if @chat_room.save
---
INSERT INTO "chat_rooms" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello"], ["user_id", 1], ["created_at", 2017-04-30 00:45:20 UTC], ["updated_at", 2017-04-30 00:45:20 UTC]]

  def show
    @chat_room = ChatRoom.includes(:messages).find_by(id: params[:id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = $1 ORDER BY "messages"."created_at" ASC  [["chat_room_id", 2]]